results/raw.txt
+ wrk -t16 -c100 -d30s --latency https://laravel12-nginx-fpm.ddev.site/api/health-check
Running 30s test @ https://laravel12-nginx-fpm.ddev.site/api/health-check
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   125.03ms   16.66ms 321.56ms   88.29%
    Req/Sec    47.88     11.36   140.00     58.38%
  Latency Distribution
     50%  121.93ms
     75%  128.26ms
     90%  141.39ms
     99%  174.73ms
  22294 requests in 30.06s, 3.08MB read
Requests/sec:    741.62
Transfer/sec:    105.01KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-nginx-fpm.ddev.site/api/static
Running 30s test @ https://laravel12-nginx-fpm.ddev.site/api/static
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   128.29ms   12.65ms 208.71ms   83.49%
    Req/Sec    46.56     10.84   140.00     64.80%
  Latency Distribution
     50%  126.54ms
     75%  132.73ms
     90%  141.94ms
     99%  172.91ms
  21668 requests in 30.09s, 5.37MB read
Requests/sec:    720.09
Transfer/sec:    182.84KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-nginx-fpm.ddev.site/api/http-request
Running 30s test @ https://laravel12-nginx-fpm.ddev.site/api/http-request
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   160.67ms   20.00ms 241.01ms   78.52%
    Req/Sec    37.19     12.56   151.00     56.57%
  Latency Distribution
     50%  153.96ms
     75%  167.74ms
     90%  192.28ms
     99%  210.10ms
  17275 requests in 30.10s, 7.10MB read
Requests/sec:    573.92
Transfer/sec:    241.56KB

---

+ wrk -t16 -c100 -d30s --latency https://laravel12-frankenphp.ddev.site/api/health-check
Running 30s test @ https://laravel12-frankenphp.ddev.site/api/health-check
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   142.68ms   30.00ms 384.03ms   80.82%
    Req/Sec    41.91     12.76   111.00     73.99%
  Latency Distribution
     50%  136.76ms
     75%  153.50ms
     90%  176.02ms
     99%  261.00ms
  19360 requests in 30.10s, 2.88MB read
Requests/sec:    643.20
Transfer/sec:     97.99KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-frankenphp.ddev.site/api/static
Running 30s test @ https://laravel12-frankenphp.ddev.site/api/static
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   142.90ms   26.28ms 297.56ms   74.16%
    Req/Sec    41.83     12.63   140.00     74.79%
  Latency Distribution
     50%  139.50ms
     75%  156.48ms
     90%  176.26ms
     99%  221.70ms
  19430 requests in 30.10s, 3.98MB read
Requests/sec:    645.59
Transfer/sec:    135.55KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-frankenphp.ddev.site/api/http-request
Running 30s test @ https://laravel12-frankenphp.ddev.site/api/http-request
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   165.65ms   27.00ms 282.33ms   71.42%
    Req/Sec    36.08     12.67   142.00     55.92%
  Latency Distribution
     50%  162.27ms
     75%  181.60ms
     90%  201.60ms
     99%  236.71ms
  16746 requests in 30.10s, 6.16MB read
Requests/sec:    556.35
Transfer/sec:    209.72KB

---

+ wrk -t16 -c100 -d30s --latency https://laravel12-apache-fpm.ddev.site/api/health-check
Running 30s test @ https://laravel12-apache-fpm.ddev.site/api/health-check
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   125.92ms   14.51ms 338.57ms   91.21%
    Req/Sec    47.52     10.46   110.00     63.08%
  Latency Distribution
     50%  123.46ms
     75%  128.77ms
     90%  137.49ms
     99%  191.82ms
  22183 requests in 30.07s, 3.43MB read
Requests/sec:    737.65
Transfer/sec:    116.70KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-apache-fpm.ddev.site/api/static
Running 30s test @ https://laravel12-apache-fpm.ddev.site/api/static
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   145.41ms   63.99ms 480.27ms   89.01%
    Req/Sec    43.38     14.67   191.00     67.57%
  Latency Distribution
     50%  125.65ms
     75%  133.09ms
     90%  214.48ms
     99%  410.40ms
  19789 requests in 30.10s, 4.51MB read
Requests/sec:    657.50
Transfer/sec:    153.46KB
+ wrk -t16 -c100 -d30s --latency https://laravel12-apache-fpm.ddev.site/api/http-request
Running 30s test @ https://laravel12-apache-fpm.ddev.site/api/http-request
  16 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   161.33ms   19.41ms 276.62ms   77.69%
    Req/Sec    36.99     12.66   120.00     54.82%
  Latency Distribution
     50%  154.97ms
     75%  168.18ms
     90%  191.77ms
     99%  213.05ms
  17148 requests in 30.10s, 6.70MB read
Requests/sec:    569.78
Transfer/sec:    228.13KB